In [1]:
import pandas as pd

In [4]:
df = pd.read_excel("C:\\Users\\thora\\Documents\\car price prediction 2.xlsx")

In [5]:
df.head()

       Name  Kilometers_Driven  Price  horsepower
0   Maruti               72000   1.75         111
1  Hyundai               41000  12.50         111
2    Honda               46000   4.50         154
3    Maruti              87000   6.00         102
4     Audi               40670  17.74         115

In [7]:
df.tail()

           Name  Kilometers_Driven  Price  horsepower
54     Hyundai               54000   3.60          68
55  Volkswagen               39000   3.99         101
56       Renaul              16542   3.30         101
57     Hyundai               32000   2.07         101
58      Nissan              121812   7.75         135

In [8]:
df.shape

(59, 4)

In [9]:
df.isnull().sum()

Name                 0
Kilometers_Driven    0
Price                0
horsepower           0
dtype: int64

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               59 non-null     object
 1   Kilometers_Driven  59 non-null     int64
 2   Price              59 non-null     float64
 3   horsepower         59 non-null     int64
dtypes: float64(1), int64(2), object(1)
memory usage: 2.0+ KB

In [11]:
df.describe()

       Kilometers_Driven      Price  horsepower
count          59.000000  59.000000   59.000000
mean        60885.983051   8.176102  102.406780
std         34844.008354   6.893638   40.556524
min         13648.000000   1.250000   48.000000
25%         40835.000000   3.850000   70.000000
50%         55431.000000   5.500000  100.000000
75%         73500.000000  10.030000  113.000000
max        262000.000000  28.000000  262.000000

In [13]:
X = df[['Kilometers_Driven','horsepower']]

In [14]:
X.head()

   Kilometers_Driven  horsepower
0              72000         111
1              41000         111
2              46000         154
3              87000         102
4              40670         115

In [15]:
y = df.Price

In [16]:
y.head()

0     1.75
1    12.50
2     4.50
3     6.00
4    17.74
Name: Price, dtype: float64

In [17]:
from sklearn.linear_model import LinearRegression

In [19]:
model = LinearRegression()

In [20]:
model.fit(X,y)

LinearRegression()

In [25]:
coef = model.coef_
coef

array([ 9.65759973e-07, -1.63697620e-02])

In [26]:
intercept = model.intercept_
intercept

9.793675054969981

In [27]:
model.predict([[45000,112]])

C:\Users\thora\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([8.00372092])

In [28]:
output = coef[0]*45000 + coef[1]*112 + intercept

In [29]:
output

8.003720915038134

In [30]:
model.score(X,y)

0.00906992507584492

In [37]:
df = pd.read_excel("C:\\Users\\thora\\Documents\\cars2.xlsx")

In [38]:
df.head()

       Name  horsepower  stroke  Price
0   Maruti          111    2.68   1.75
1  Hyundai          111    2.68  12.50
2    Honda          154    3.47   4.50
3    Maruti         102    3.40   6.00
4     Audi          115    3.40  17.74

In [39]:
X = df[['horsepower','stroke']]

In [41]:
X.head()

   horsepower  stroke
0         111    2.68
1         111    2.68
2         154    3.47
3         102    3.40
4         115    3.40

In [42]:
y = df.Price

In [43]:
y.head()

0     1.75
1    12.50
2     4.50
3     6.00
4    17.74
Name: Price, dtype: float64

In [44]:
from sklearn.preprocessing import MinMaxScaler

In [45]:
Scaler = MinMaxScaler()

In [46]:
ScaledX = Scaler.fit_transform(X)

In [47]:
ScaledX

array([[0.29439252, 0.        ],
       [0.29439252, 0.        ],
       [0.4953271 , 0.53020134],
       [0.25233645, 0.48322148],
       [0.31308411, 0.48322148],
       [0.28971963, 0.48322148],
       [0.28971963, 0.48322148],
       [0.28971963, 0.48322148],
       [0.42990654, 0.48322148],
       [0.52336449, 0.48322148],
       [0.24766355, 0.08053691],
       [0.24766355, 0.08053691],
       [0.3411215 , 0.34228188],
       [0.3411215 , 0.34228188],
       [0.3411215 , 0.34228188],
       [0.62616822, 0.47651007],
       [0.62616822, 0.47651007],
       [0.62616822, 0.47651007],
       [0.        , 0.23489933],
       [0.10280374, 0.2885906 ],
       [0.10280374, 0.2885906 ],
       [0.09345794, 0.36912752],
       [0.09345794, 0.36912752],
       [0.25233645, 0.47651007],
       [0.09345794, 0.36912752],
       [0.09345794, 0.36912752],
       [0.09345794, 0.36912752],
       [0.25233645, 0.47651007],
       [0.18691589, 0.52348993],
       [0.45327103, 0.81879195],
       [0.04672897, 0.48993289],
       [0.13084112, 0.48993289],
       [0.05607477, 0.26174497],
       [0.13084112, 0.48993289],
       [0.13084112, 0.48993289],
       [0.13084112, 0.48993289],
       [0.13084112, 0.48993289],
       [0.17757009, 0.60402685],
       [0.17757009, 0.60402685],
       [0.17757009, 0.60402685],
       [0.17757009, 0.60402685],
       [0.24766355, 0.60402685],
       [0.24299065, 0.60402685],
       [0.14018692, 0.36912752],
       [0.10280374, 0.2885906 ],
       [0.10280374, 0.2885906 ],
       [0.19626168, 0.36912752],
       [0.59813084, 1.        ],
       [0.59813084, 1.        ],
       [1.        , 0.05369128],
       [0.09345794, 0.31543624],
       [0.09345794, 0.31543624],
       [0.09345794, 0.31543624],
       [0.09345794, 0.31543624],
       [0.09345794, 0.31543624],
       [0.24766355, 0.38590604],
       [0.24766355, 0.38590604],
       [0.24766355, 0.38590604],
       [0.40654206, 0.38590604]])

In [48]:
model.fit(ScaledX,y)

LinearRegression()

In [49]:
model.score(ScaledX,y)

0.015183261387586966

In [50]:
Scaler.transform([[112,2.67]])

C:\Users\thora\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but MinMaxScaler was fitted with feature names
  warnings.warn(

array([[ 0.29906542, -0.00671141]])

In [51]:
model.predict(Scaler.transform([[112,2.67]]))

C:\Users\thora\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but MinMaxScaler was fitted with feature names
  warnings.warn(

array([9.29807247])